Reports/ОтчетПоЗаписиНаРемонт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>ОтчетПоЗаписиНаРемонт</Name>
			<Comment>Отчет по записи на ремонт</Comment>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/ПланированиеРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПланированиеРабот</Name>
			<Comment>Планирование работ</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Продолжительность</Name>
					<Comment>Продолжительность в секундах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеАктуален</Name>
					<Comment>Не актуален</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект планирования</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
						<v8:Type>cfg:CatalogRef.ПричиныОбращений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторГруппы</Name>
					<Comment>Идентификатор группы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеОбъекта</Name>
					<Comment>Представление объекта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Comment>Документ планирования</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРемонт</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Начало</Name>
					<Comment>Дата начала интервала</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Конец</Name>
					<Comment>Дата окончания интервала</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОбъектаПланирования</Name>
					<Comment>Вид объекта планирования</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбъектовПланированияРесурсов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Comment>Идентификатор объекта планирования</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РабочееМесто</Name>
					<Comment>Ресурс</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Цеха</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Исполнитель</Name>
					<Comment>Ресурс</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Автомобили.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>Автомобили</Name>
			<Comment>Дополнительные характеристики автомобилей</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>Значение дополнительного свойства</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодтверждающиеДокументы</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:EnumRef.ВидАвтомобиля</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсточникИнформации</Name>
					<Comment>Источник информации характеристики</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ИсточникиИнформацииХарактеристикАвтомобиля</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор - пользователь, добавивший характеристику автомобиля</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Comment>Автомобиль</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗначения</Name>
					<Comment>Вид значения дополнительного свойства автомобиля</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ДополнительнаяИнформацияАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ДополнительнаяИнформацияАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ДополнительнаяИнформацияАвтомобилей</Name>
			<Comment>Дополнительная информация автомобилей</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Хозяин</Name>
					<Comment>Признак хозяина автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пробег</Name>
					<Comment>Признак пробега автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГосНомер</Name>
					<Comment>Признак государственного номера автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТехПаспорт</Name>
					<Comment>Признак номера техпаспорта автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СвидетельствоОРегистрацииТС</Name>
					<Comment>Свидетельство о регистрации ТС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидАвтомобиля</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриобретенУФизЛица</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Автоработы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Автоработы</Name>
			<Comment>Автоработы</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Comment>Номер автоработы по каталогу</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Артикул</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АртикулДляПоиска</Name>
					<Comment>Артикул для поиска</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Артикул</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Полное наименование автоработы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Базовая номенклатура автоработы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяВыполнения</Name>
					<Comment>Время выполнения</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоОкраска</Name>
					<Comment>Это окраска</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлКартинки</Name>
					<Comment>Основное изображение</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.АвтоработыПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидИспользования</Name>
					<Comment>Определяет доступность автоработы для выбора в планировании и производстве</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыИспользованияАвторабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Comment>Тип</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыАвторабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоДополнительноеПредложение</Name>
					<Comment>Признак того, что эта авторабота является дополнительным предложением</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеОписание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АвтоработыПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеноваяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеУчитыватьПриПоискеПовторныхРемонтов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРасчетаСтоимостиРаботы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРасчетаСтоимостиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НормыВремени</Name>
					<Comment>Нормы времени выполнения работы</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Модель</Name>
							<Comment>Модель</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Модели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантКомплектации</Name>
							<Comment>Вариант комплектации автомобиля</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяВыполнения</Name>
							<Comment>Время выполнения</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/ОтчетПоЗаписиНаРемонт/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Настройки общей формы отчета подсистемы "Варианты отчетов".
//
// Параметры:
//   Форма - УправляемаяФорма - Форма отчета.
//   КлючВарианта - Строка - Имя предопределенного варианта отчета или уникальный идентификатор пользовательского.
//   Настройки - Структура - Настройкм отчета
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	Если ТипЗнч(Настройки) = Тип("Структура") И НЕ Настройки.Свойство("Отбор") Тогда
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("НачалоПериода", НачалоДня(ТекущаяДатаСеанса()));
		СтруктураОтбора.Вставить("КонецПериода",  КонецДня(ТекущаяДатаСеанса()));
		Настройки.Вставить("Отбор", СтруктураОтбора);
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьНачальныеНастройки()

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ВариантОтчета = КомпоновщикНастроек.Настройки.ДополнительныеСвойства.КлючВарианта;
	
	ВнешниеНаборыДанных = Новый Структура("ТаблицаРабот", ОсновнойЗапрос(ВариантОтчета).Выполнить());
	ОтчетыПлатформаСервер
		.ВывестиОтчет(ЭтотОбъект, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка, ВнешниеНаборыДанных);
	
КонецПроцедуры // ПриКомпоновкеРезультата()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ГраницыОтчета()
	
	Возврат Новый Структура(
		"Начало,Конец",
		НачалоДня(ОтчетыПлатформаСервер.КомпоновщикПолучитьЗначениеПараметра("НачалоПериода", КомпоновщикНастроек.Настройки)),
		КонецДня(ОтчетыПлатформаСервер.КомпоновщикПолучитьЗначениеПараметра("КонецПериода", КомпоновщикНастроек.Настройки)));
	
КонецФункции

Функция ДатыВнутриГраниц(Границы)
	
	ТипДата = ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя);
	ДатыОтчета = Новый ТаблицаЗначений;
	ДатыОтчета.Колонки.Добавить("НачалоДня", ТипДата);
	ДатыОтчета.Колонки.Добавить("КонецДня", ТипДата);
	
	ТекущийДень = Границы.Начало;
	
	Пока ТекущийДень < Границы.Конец Цикл
		
		НоваяСтрока = ДатыОтчета.Добавить();
		НоваяСтрока.НачалоДня = ТекущийДень;
		НоваяСтрока.КонецДня = КонецДня(ТекущийДень);
		ТекущийДень = ТекущийДень + 24*60*60;
		
	КонецЦикла;
	
	Возврат ДатыОтчета;
	
КонецФункции

Функция ОсновнойЗапрос(ВариантОтчета)
	
	ГраницыОтчета = ГраницыОтчета();
	
	ТолькоЗаявкиНаРемонт = ОтчетыПлатформаСервер.КомпоновщикПолучитьЗначениеПараметра(
		"ТолькоЗаявкиНаРемонт", 
		КомпоновщикНастроек.Настройки);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	Т.НачалоДня КАК НачалоДня,
	|	Т.КонецДня КАК КонецДня
	|ПОМЕСТИТЬ ДатыОтчета
	|ИЗ
	|	&ДатыОтчета КАК Т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПланированиеРабот.Документ КАК Документ,
	|	ПланированиеРабот.Начало КАК Начало,
	|	ПланированиеРабот.Конец КАК Конец,
	|	ПланированиеРабот.РабочееМесто КАК РабочееМесто,
	|	ПланированиеРабот.Исполнитель КАК Исполнитель,
	|	ВЫБОР
	|		КОГДА ПланированиеРабот.Объект ССЫЛКА Справочник.Автоработы
	|			ТОГДА ПланированиеРабот.Объект
	|		ИНАЧЕ ""-""
	|	КОНЕЦ КАК Работа
	|ПОМЕСТИТЬ Запланировано
	|ИЗ
	|	РегистрСведений.ПланированиеРабот КАК ПланированиеРабот
	|ГДЕ
	|	(ПланированиеРабот.Начало МЕЖДУ &Начало И &Конец
	|			ИЛИ ПланированиеРабот.Конец МЕЖДУ &Начало И &Конец
	|			ИЛИ &Начало МЕЖДУ ПланированиеРабот.Начало И ПланированиеРабот.Конец)" + ?(ТолькоЗаявкиНаРемонт, "
	|	И ТипЗначения(ПланированиеРабот.Документ) = Тип(Документ.ЗаявкаНаРемонт)", "
	|	И НЕ ПланированиеРабот.НеАктуален") + "
	|	И ПланированиеРабот.Документ <> НЕОПРЕДЕЛЕНО // FIXME: Фильтруем битые записи содержащиеся в некоторых базах.
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаявкаНаРемонт.Ссылка КАК Документ,
	|	ЗаявкаНаРемонт.Автомобиль КАК Автомобиль,
	|	ЗаявкаНаРемонт.Модель КАК Модель,
	|	ЗаявкаНаРемонт.Организация КАК Организация,
	|	ЗаявкаНаРемонт.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	ЗаявкаНаРемонт.ПодразделениеКомпании.ФилиалКомпании КАК Филиал,
	|	ЗаявкаНаРемонт.Мастер КАК Мастер,
	|	ВЫБОР
	|		КОГДА ЗаявкаНаРемонт.Заказчик <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ЗаявкаНаРемонт.Заказчик
	|		ИНАЧЕ ЗаявкаНаРемонт.ОбращениеККлиенту
	|	КОНЕЦ КАК Заказчик,
	|	ЗаявкаНаРемонт.ПредставлениеТелефона КАК Телефон,
	|	ЗаявкаНаРемонт.ОписаниеПричиныОбращения КАК ПричинаОбращения
	|ПОМЕСТИТЬ ДанныеДокументов
	|ИЗ
	|	Документ.ЗаявкаНаРемонт КАК ЗаявкаНаРемонт
	|ГДЕ
	|	ЗаявкаНаРемонт.Ссылка В
	|			(ВЫБРАТЬ
	|				Запланировано.Документ КАК Документ
	|			ИЗ
	|				Запланировано КАК Запланировано)" + ?(ТолькоЗаявкиНаРемонт, "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказНаряд.Ссылка,
	|	ЗаказНаряд.СводныйРемонтныйЗаказ.Автомобиль,
	|	ЗаказНаряд.СводныйРемонтныйЗаказ.Автомобиль.Модель,
	|	ЗаказНаряд.СводныйРемонтныйЗаказ.Организация,
	|	ЗаказНаряд.СводныйРемонтныйЗаказ.ПодразделениеКомпании,
	|	ЗаказНаряд.СводныйРемонтныйЗаказ.ПодразделениеКомпании.ФилиалКомпании,
	|	ЗаказНаряд.Мастер,
	|	ЗаказНаряд.СводныйРемонтныйЗаказ.Заказчик,
	|	ЗаказНаряд.СводныйРемонтныйЗаказ.ПредставлениеТелефона,
	|	ЗаказНаряд.ОписаниеПричиныОбращения
	|ИЗ
	|	Документ.ЗаказНаряд КАК ЗаказНаряд
	|ГДЕ
	|	ЗаказНаряд.Ссылка В
	|			(ВЫБРАТЬ
	|				Запланировано.Документ КАК Документ
	|			ИЗ
	|				Запланировано КАК Запланировано)", "") + "
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АвтомобилиСрезПоследних.Автомобиль КАК Автомобиль,
	|	АвтомобилиСрезПоследних.Значение КАК ГосНомер
	|ПОМЕСТИТЬ ГосНомера
	|ИЗ
	|	РегистрСведений.Автомобили.СрезПоследних(
	|			,
	|			Автомобиль В
	|					(ВЫБРАТЬ
	|						ДанныеДокументов.Автомобиль КАК Автомобиль
	|					ИЗ
	|						ДанныеДокументов КАК ДанныеДокументов)
	|				И ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.ГосНомер)) КАК АвтомобилиСрезПоследних
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДокументов.Документ КАК Документ,
	|	ДанныеДокументов.Автомобиль КАК Автомобиль,
	|	ДанныеДокументов.Модель КАК Модель,
	|	ДанныеДокументов.Организация КАК Организация,
	|	ДанныеДокументов.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	ДанныеДокументов.Филиал КАК Филиал,
	|	ДанныеДокументов.Мастер КАК Мастер,
	|	ДанныеДокументов.Заказчик КАК Заказчик,
	|	ДанныеДокументов.Телефон КАК Телефон,
	|	ДанныеДокументов.ПричинаОбращения КАК ПричинаОбращения,
	|	ЕСТЬNULL(ГосНомера.ГосНомер, ""-"") КАК ГосНомер
	|ПОМЕСТИТЬ ДанныеДокументовСГосНомерами
	|ИЗ
	|	ДанныеДокументов КАК ДанныеДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ГосНомера КАК ГосНомера
	|		ПО ДанныеДокументов.Автомобиль = ГосНомера.Автомобиль
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДанныеДокументов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ГосНомера
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Запланировано.Документ КАК Документ,
	|	Запланировано.Начало КАК Начало,
	|	Запланировано.Конец КАК Конец,
	|	Запланировано.РабочееМесто КАК РабочееМесто,
	|	Запланировано.Исполнитель КАК Исполнитель,
	|	Запланировано.Работа КАК Работа,
	|	ЕСТЬNULL(ДанныеДокументовСГосНомерами.Автомобиль, ""-"") КАК Автомобиль,
	|	ЕСТЬNULL(ДанныеДокументовСГосНомерами.Модель, ""-"") КАК Модель,
	|	ЕСТЬNULL(ДанныеДокументовСГосНомерами.Организация, ""-"") КАК Организация,
	|	ЕСТЬNULL(ДанныеДокументовСГосНомерами.ПодразделениеКомпании, ""-"") КАК ПодразделениеКомпании,
	|	ЕСТЬNULL(ДанныеДокументовСГосНомерами.Филиал, ""-"") КАК Филиал,
	|	ЕСТЬNULL(ДанныеДокументовСГосНомерами.Мастер, ""-"") КАК Мастер,
	|	ЕСТЬNULL(ДанныеДокументовСГосНомерами.Заказчик, ""-"") КАК Заказчик,
	|	ЕСТЬNULL(ДанныеДокументовСГосНомерами.Телефон, ""-"") КАК Телефон,
	|	ЕСТЬNULL(ДанныеДокументовСГосНомерами.ПричинаОбращения, ""-"") КАК ПричинаОбращения,
	|	ЕСТЬNULL(ДанныеДокументовСГосНомерами.ГосНомер, ""-"") КАК ГосНомер
	|ПОМЕСТИТЬ ЗапланированоСДанными
	|ИЗ
	|	Запланировано КАК Запланировано
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеДокументовСГосНомерами КАК ДанныеДокументовСГосНомерами
	|		ПО Запланировано.Документ = ДанныеДокументовСГосНомерами.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Запланировано
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДанныеДокументовСГосНомерами
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДатыОтчета.НачалоДня КАК Дата,
	|	ЗапланированоСДанными.Документ КАК Документ,
	|	ВЫБОР
	|		КОГДА ЗапланированоСДанными.Начало < ДатыОтчета.НачалоДня
	|			ТОГДА ДатыОтчета.НачалоДня
	|		ИНАЧЕ ЗапланированоСДанными.Начало
	|	КОНЕЦ КАК НачалоРабот,
	|	ВЫБОР
	|		КОГДА ЗапланированоСДанными.Конец > ДатыОтчета.КонецДня
	|			ТОГДА ДатыОтчета.КонецДня
	|		ИНАЧЕ ЗапланированоСДанными.Конец
	|	КОНЕЦ КАК КонецРабот,
	|	ЗапланированоСДанными.РабочееМесто КАК РабочееМесто,
	|	ЗапланированоСДанными.Исполнитель КАК Исполнитель,
	|	ЗапланированоСДанными.Работа КАК Работа,
	|	ЗапланированоСДанными.Автомобиль КАК Автомобиль,
	|	ЗапланированоСДанными.Модель КАК Модель,
	|	ЗапланированоСДанными.Организация КАК Организация,
	|	ЗапланированоСДанными.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	ЗапланированоСДанными.Филиал КАК Филиал,
	|	ЗапланированоСДанными.Мастер КАК Мастер,
	|	ЗапланированоСДанными.Заказчик КАК Заказчик,
	|	ЗапланированоСДанными.Телефон КАК Телефон,
	|	ЗапланированоСДанными.ПричинаОбращения КАК ПричинаОбращения,
	|	ЗапланированоСДанными.ГосНомер КАК ГосНомер
	|ИЗ
	|	ДатыОтчета КАК ДатыОтчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗапланированоСДанными КАК ЗапланированоСДанными
	|		ПО (ДатыОтчета.НачалоДня <= ЗапланированоСДанными.Начало
	|					И ДатыОтчета.КонецДня >= ЗапланированоСДанными.Начало
	|				ИЛИ ДатыОтчета.НачалоДня <= ЗапланированоСДанными.Конец
	|					И ДатыОтчета.КонецДня >= ЗапланированоСДанными.Конец
	|				ИЛИ ЗапланированоСДанными.Начало <= ДатыОтчета.НачалоДня
	|					И ЗапланированоСДанными.Конец >= ДатыОтчета.НачалоДня)";
	Запрос.УстановитьПараметр("ДатыОтчета", ДатыВнутриГраниц(ГраницыОтчета));
	Запрос.УстановитьПараметр("Начало", ГраницыОтчета.Начало);
	Запрос.УстановитьПараметр("Конец", ГраницыОтчета.Конец);
	
	Возврат Запрос;
	
КонецФункции

#КонецОбласти

#КонецЕсли
